{"autostitch-is-witchcraft":{"title":"Autostitch is witchcraft","created":"2008-06-13 20:04:00","url":"autostitch-is-witchcraft","tags":["photography"],"comments":[{"name":"Russell","website":"http:\/\/www.rdjs.co.uk","comment":"That quote is great!\r\n\"any sufficiently advanced technology is indistinguishable from magic\"\r\nI always wanted to know how to create a panorama... all I need to do now is save up for that mac.","created":"2008-07-29 20:27:42"}]},"the-iphone-3g-vs-the-nokia-n95":{"title":"The iPhone 3G vs the Nokia N95","created":"2008-06-12 12:33:00","url":"the-iphone-3g-vs-the-nokia-n95","tags":["mobile","apple"],"comments":[{"name":"Phil","website":"","comment":"12th June 2008 Ciaran: I really can't see the same ecosystem flourishing around iPhone.\r\n\r\n24th April 2009 Apple: 1 billion downloads from the iPhone Appstore.\r\n\r\nFlourish, I think it has :)","created":"2009-04-24 16:16:59"},{"name":"Simon Harris","website":"http:\/\/pointbeing.net\/","comment":"I'd hardly call the Appstore an ecosystem, Phil. It's part of a benign-but-for-how-long dictatorship designed to make damn sure that people - despite spending hundreds of pounds on some piece of tatty hardware - aren't allowed to do anything with it without Apple's approval. And quite frankly, sod that.","created":"2009-06-14 12:12:42"},{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"The iPhone is tatty hardware?","created":"2009-06-15 11:17:15"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Simon - I've found the Apple Store user experience to be about a million times better than my experiences with Nokia and S60 apps, but you're right in that it's frustrating to have to jailbreak the phone to get 'non-Apple-approved' applications on there.","created":"2009-06-15 11:29:44"}]},"fire-eagle-yahoos-location-service":{"title":"Fire Eagle - Yahoo's location service","created":"2008-05-12 18:44:00","url":"fire-eagle-yahoos-location-service","tags":["mobile","web"]},"new-blog":{"title":"New blog","created":"2008-05-12 13:24:00","url":"new-blog"},"a-new-comments-system":{"title":"A new comments system","created":"2008-07-10 16:06:23","url":"a-new-comments-system","tags":["php","web"]},"some-thoughts-on-zend-php5-certification":{"title":"Some thoughts on Zend PHP5 Certification","created":"2008-07-17 12:15:24","url":"some-thoughts-on-zend-php5-certification","tags":["php"]},"cracking-a-monkey-puzzle":{"title":"Cracking a monkey puzzle","created":"2008-07-22 10:57:18","url":"cracking-a-monkey-puzzle","comments":[{"name":"Simon","website":"http:\/\/pointbeing.net","comment":"Too cryptic for me :) What's the monkey reference, I wonder?","created":"2008-07-22 22:35:16"},{"name":"Ciaran","website":"http:\/\/ciaranmcnulty.com","comment":"Araucaria is the Monkey Puzzle Tree","created":"2008-07-24 16:54:56"}]},"optimising-a-site-for-iphone":{"title":"Optimising a site for iPhone","created":"2008-07-28 13:41:50","url":"optimising-a-site-for-iphone","tags":["mobile","web","apple"],"comments":[{"name":"kelly","website":"http:\/\/kellybaker.ca","comment":" Great post. I've been looking around for an hour trying to find this info. Thanks for sharing!","created":"2008-09-04 17:16:22"}]},"delivering-pages-as-pdf-using-php":{"title":"Delivering pages as PDF using PHP","created":"2008-08-07 20:23:25","url":"delivering-pages-as-pdf-using-php","tags":["php","web"],"comments":[{"name":"Russell","website":"http:\/\/www.rdjs.co.uk","comment":"Being a newly qualified Zend Framework Genius I thought you might suggest using Zend_Pdf?","created":"2008-08-12 15:54:20"},{"name":"Ciaran","website":"http:\/\/ciaranmcnulty.com","comment":"Well I've looked at Zend_Pdf a bit, but the problem with it seems to be that, like other programmatic PDF generators, it's actually remarkably hard to format a document in it without writing hundreds of lines of code.\r\n\r\nAlso, when starting off with an HTML document it made sense to me to keep to the HTML->PDF route.  I suppose it would be possible to parse the HTML source and generate a Zend_Pdf object from it, then render the Zend_Pdf but it would be a lot more complicated.\r\n\r\nThat said, if you don't want to touch XSL it may be a good way to go.","created":"2008-08-12 17:34:13"}]},"how-much-of-your-data-is-available-online":{"title":"How much of your data is available online?","created":"2008-10-01 11:17:05","url":"how-much-of-your-data-is-available-online","tags":["web","microformats"],"comments":[{"name":"Russell","website":"http:\/\/www.rdjs.co.uk","comment":"This reminds me, I need to get a new credit card....\r\n\r\n;)","created":"2008-10-06 14:40:12"}]},"keeping-your-javascript-clean":{"title":"Keeping your Javascript clean","created":"2008-10-29 12:28:38","url":"keeping-your-javascript-clean","tags":["web","microformats","javascript"],"comments":[{"name":"raj","website":"http:\/\/www.tatainsuranced.com","comment":"please put in proper way","created":"2009-03-12 04:59:17"}]},"keeping-querystrings-clean-with-zend-framework":{"title":"Keeping querystrings clean with Zend Framework","created":"2008-11-30 12:14:24","url":"keeping-querystrings-clean-with-zend-framework","tags":["php","zend-framework","seo"],"comments":[{"name":"Ciaran McNulty","website":"http:\/\/ciaranmnulty.com","comment":"I forgot to add, I'd consider this code public domain so anyone can use\/modify\/redistribute it.","created":"2008-12-08 12:26:44"},{"name":"Alex","website":"","comment":"I would suggest replacing your code with what i wrote below. It's much more clean and less prone to errors. One could argue that using the routeShutdown instead of the Startup could lead to some overhead (because the route is precessed), but i guess ultimately it depends on the volume of traffic that goes through this, and that may be site dependent. For grid filters in an admin for example, this  would be the better solution.\r\n\r\npublic function routeShutdown( Zend_Controller_Request_Abstract $request )\r\n{\r\n    if( count( $request->getQuery() ) )\r\n    {\r\n        $router = Zend_Controller_Front::getInstance()->getRouter();\r\n        $url = $router->assemble( array_reverse( $request->getQuery(), true ), null, false, true );\r\n\r\n        $this->getResponse()->setRedirect( $url )->sendResponse();\r\n        exit;\r\n    }\r\n}","created":"2009-01-26 22:38:58"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Interesting stuff, Alex! I wasn't aware you could play with the Router like that, it would be interesting to compare the overheads of doing this pre\/post routing.","created":"2009-01-29 09:20:29"},{"name":"Marc","website":"","comment":"this article and your comments are very helpful to me. thank you!","created":"2010-01-14 22:12:16"},{"name":"Joe Devon","website":"http:\/\/twitter.com\/joedevon","comment":"Nice idea! You didn't mention this, but it would be nice to couple this with some javascript on the front end to remove empty variables before submitting and use this as a backup...","created":"2010-04-02 20:30:08"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"@Joe Thanks for the comment, I did think about doing something with Javascript but never got around to implementing it - let us know if you do!","created":"2010-04-06 13:30:48"},{"name":"René Pardon","website":"http:\/\/www.BoonWeb.de\/","comment":"Thank you for sharing code and your awesome comments :)\r\nThey're really helpful to handle query strings on a Zend Form submit.","created":"2010-04-26 16:36:34"},{"name":"Daniel Levitt","website":"http:\/\/www.whatcouldicook.com","comment":"Amazing!! \r\n\r\nYou've really helped me with the biggest headache. Genius.\r\n\r\nOnly using Alex's code worked for me but its really brilliant. Thank you again.","created":"2010-05-11 17:17:29"}]},"sharing-music-between-a-mac-and-xbox-with-connect360":{"title":"Sharing music between a Mac and Xbox with Connect360","created":"2008-12-09 14:23:24","url":"sharing-music-between-a-mac-and-xbox-with-connect360","tags":["apple","xbox"]},"embedding-third-party-content-in-your-site-using-oembed":{"title":"Embedding third-party content in your site using oEmbed","created":"2009-01-28 14:11:09","url":"embedding-third-party-content-in-your-site-using-oembed","tags":["web","microformats"],"comments":[{"name":"Tobias","website":"http:\/\/uxzentrisch.de","comment":"Do you know http:\/\/embedit.me\/ and can comment on it?\r\nA friend of mine tells me its like oohembed but even simpler.","created":"2009-10-29 09:14:10"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"To be honest, Tobias, it doesn't look finished - I'd certainly not use it yet","created":"2009-12-07 14:45:08"},{"name":"Jason","website":"http:\/\/autoembed.com","comment":"See AutoEmbed.com too, as it's a good solution for simple video embedding needs.","created":"2010-04-07 20:51:12"}]},"combining-bordering-ranges-of-data-in-mysql":{"title":"Combining bordering ranges of data in MySQL","created":"2009-02-12 18:04:45","url":"combining-bordering-ranges-of-data-in-mysql","tags":["mysql"]},"rel-canonical-should-be-handled-with-care":{"title":"Rel-canonical should be handled with care","created":"2009-02-16 14:19:26","url":"rel-canonical-should-be-handled-with-care","tags":["web","microformats","html","seo"],"comments":[{"name":"Simon Harris","website":"http:\/\/pointbeing.net\/","comment":"I'd have to point out that Google weren't acting unilaterally (not this time around at least), rather this initiative was announced by Google, Yahoo and Microsoft on the same day. See also:\r\n\r\nhttp:\/\/ysearchblog.com\/2009\/02\/12\/fighting-duplication-adding-more-arrows-to-your-quiver\/\r\nhttp:\/\/blogs.msdn.com\/webmaster\/archive\/2009\/02\/12\/partnering-to-help-solve-duplicate-content-issues.aspx\r\n\r\nThe idea of (for example) search engine companies adapting HTML for their own purposes does leave me feeling uneasy, all the same.\r\n\r\nThat said, I can't say I prefer either of your methods. A 301 means \"moved permanently\", and in the case of so-called canonical URLs, nothing has moved. The Content-Location header also seems inappropriate, but then my reading of the paragraph from RFC2616 seems to be the complete opposite of yours! I interpret the semantic as being \"here's this other location, I got the relevant stuff from there just now, but it might move\" which is far from what canonical URLs are trying to achieve.\r\n\r\nThe Content-Location header seems to be more approriate for implementation of content-negotation, as in this paper:\r\n\r\nhttp:\/\/www.w3.org\/TR\/cooluris\/#conneg\r\n\r\nI realise that I'm not offering any constructive alternatives, but then I tend also to subscribe to the philosophy that if you need this device in the first place, you're probably doing it wrong. \r\n","created":"2009-02-16 15:39:50"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Thanks for the comments, Simon.\r\n\r\nI indeed hadn't realised Yahoo! and MS had both implemented the same thing, and the Google announcement I linked to didn't seem to mention it either!  I do wonder how they agree these things.\r\n\r\nI'm also quite interested in your interpretation of content-location.  It's one of those little-used headers so maybe I need to re-read and do some more research on what exactly it means, it's entirely possible you're right.\r\n\r\nHowever, I disagree on a couple of points:\r\n\r\n1. The 301 status may be defined as 'Moved Permanently' but there's some wiggle room in that. \r\n\r\nIn the RFC it says the resource has been moved. I would argue that clearly there was a resource there, because somebody has been able to construct a URL for it.  I don't think that the existence of a past specific representation of that resource is 100% necessary, though clearly this is a bit pedantic.\r\n\r\nThe other argument I'd make is that it's very common to set up a newly-registered domain to 301 redirect to another domain, without first taking time to establish a site there, so common usage of the 301 semantic might have evolved since the RFC was written.\r\n\r\n2. I certainly don't think this counts as 'adapting HTML'.  HTML4 specifically allows any values you like for @rel, and even encourages you to develop your own semantics.  However, if you start defining your own semantics HTML4 says you SHOULD add a @profile to your <HTML>, which this proposal doesn't suggest.  It's a slap-on-the-wrists rather than an error though.\r\n\r\nCertainly defining new @rel\/@rev values to mean specific things is not new, so even if you disagree you may have missed the boat! \r\n","created":"2009-02-16 15:53:22"},{"name":"Ciaron Dunne","website":"http:\/\/www.broadbandgenie.co.uk","comment":"Where this will be useful (unless I'm misunderstanding it) is for shops where you inevitably get a large number of pages with extremely similar content. For example, if you've sorted by price or filtered by colour using text links then the URL might change and the new page would be accessible by Google. You really don't want to confuse Google, so it's a nice way of reminding it which is the master page. Previously this has been handled by nofollow and noindex, but this way seems more elegant - rather than excluding the pages, just communicate the hierarchy to Google.","created":"2009-02-20 11:22:12"}]},"simplifying-file-operations-using-php-stream-wrappers":{"title":"Simplifying file operations using PHP stream wrappers","created":"2009-04-02 10:59:18","url":"simplifying-file-operations-using-php-stream-wrappers","tags":["php","web"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"I have not used stream wrappers before but will certainly give them a try next time. It is quite amazing what you can accomplish with such a concise code.\r\n\r\nReading this made me think about what a small fraction of PHP I actually use on a day to day basis.\r\n\r\nJust having a quick look through the manual I would estimate that I use about 5% to 10% of the available functionality regularly.\r\n\r\nThe really interesting question would be, how much of the bits that I don't use are actually useful? I think that stream wrappers are a great example of little used functionality that would actually make a developers life easier.\r\n\r\nI suppose that although you only ever use a small percentage of of what PHP is capable of the key is to be aware of more unusual functionality.","created":"2009-04-02 11:38:39"}]},"converting-html-to-pdf-using-wkhtmltopdf":{"title":"Converting HTML to PDF using wkhtmltopdf","created":"2009-04-09 21:26:58","url":"converting-html-to-pdf-using-wkhtmltopdf","tags":["web","linux"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"Creating a PDF from a web page is not that common an occurrence for me. However this looks great and I am racking my brains to think of somewhere cool to implement this!","created":"2009-04-09 21:45:38"},{"name":"Simon Harris","website":"http:\/\/pointbeing.net\/","comment":"I think that creating a PDF from an existing Web page is only one use case for this. You could use it in *any* situation where you want to generate a PDF in some dynamic, automated way such as via PHP. Rather than try to figure out the PDF format, or the workings of some arcane library, you can generate a page of HTML (which you already know, and is well documented) and then convert that.\r\n\r\nIt'll be interesting to see how well this plays with concurrency and load etc. I'll look forward to a follow-up post somewhere down the line!","created":"2009-04-09 22:14:23"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Yeah as Simon says, there are really two use cases - one is PDF versions of existing pages, but the other is generating PDFs for different uses using HTML as your templating system.\r\n\r\nThe idea that your PDF templates can be in HTML and sit in your application alongside page templates, and basically be edited by the same people, is pretty attractive.","created":"2009-04-09 23:05:35"},{"name":"Kowalikus","website":"http:\/\/kowalikus.pl","comment":"thanks for help","created":"2010-02-17 12:56:01"},{"name":"John","website":"","comment":"Any chance you could elaborate on installing the static binary?  What commands did you use to get this to work?\r\n\r\nThanks for the article!  Very helpful, I just gotta get it to work now lol.","created":"2010-03-22 20:48:03"},{"name":"nc3b","website":"","comment":"http:\/\/wkhtmltopdf.googlecode.com\/files\/wkhtmltopdf-0.9.5-static-i386.tar.bz2\r\nThat is a statically compiled binary for i386. Just download it, untar it and run it.\r\n\r\nCatalin","created":"2010-03-23 06:05:46"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"@John - It's a case of unarchiving the distributed binary that Catalin has linked to and executing the 'wkhtmltopdf' binary iniside it, adding it to the path if necessary.\r\n\r\n@Catalin - Thanks for the link!","created":"2010-03-24 20:48:37"},{"name":"eva","website":"http:\/\/no tengo ","comment":"muchas gracias co","created":"2010-05-17 12:37:37"},{"name":"Stormy","website":"","comment":"A few notes about the installation:\r\nX package is called xvfb but not vfb.\r\nTherefore the correct command is:\r\n#apt-get install xvfb\r\n\r\nAlso, you will need libxrender1 package for the static build:\r\n#apt-get install libxrender1\r\nSince you don't need a separate directory (static version is a single executable) I suggest you put it in \/usr\/local\/bin or somewhere with an existing path line.","created":"2010-06-14 11:35:20"},{"name":"Stormy","website":"","comment":"More notes about the options:\r\nFirst of all you don't need -s \"-screen 0 640x480x16\" since it's the default mode for xvfb and it seems screen resolution\/mode does not affect wkhtmltopdf output.\r\n\r\nWhat the author forgot to mention is that by default, xvfb does NOT come with any standard (web) fonts so your output PDF will be with a single font.\r\nTo rectify this - you need to install:\r\n#apt-get install msttcorefonts\r\nThen point the path in xvfb-run server options, e.g.:\r\n#xvfb-run -a -s \"-fp \/usr\/share\/fonts\/truetype\/msttcorefonts\" wkhtmltopdf http:\/\/www.angelfire.com\/fl5\/html-tutorial\/fontlist.htm test.pdf\r\n\r\nAnother issue is the default page size for wkhtmltopdf. In my case it was somewhere around 30\" which was not exactly a standard A4.\r\nIf you run onto this, set the page size (in mm) manually with (i.e. for A4 portrait):\r\n--page-width 210 --page-height 297\r\nI suggest you do the same in the html code  just in case.\r\n\r\nOn the side note - althou wkhtmltopdf does give you the option to switch to print media style, the behavour is not a 100% compatible: e.g. in case you span huge html tables over several pages it will not repeat THEAD and TFOOT as by HTML 4 Standart.\r\n\r\nThankfully, it has a powerfull support for headers and footers via HTML\/JS code which should satisfy all your needs (if you're able to code them)...","created":"2010-06-14 17:42:43"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Thanks for the comments, Stormy. \r\n\r\nInteresting note about the fonts - I didn't have that issue but maybe my distro had the package installed already for some reason.","created":"2010-06-21 11:03:19"},{"name":"Steepe","website":"","comment":"Cool, I'm kinda new to all of this. I really would like to know how do i start.\r\nI have an in-house server with an app on it that is supposed to generate reports. Can u gimme a step by step approach?\r\nThank u so much in advance.\r\nmy email is oluwamayowa@steepe.org","created":"2010-06-26 01:41:27"},{"name":"Pradeep Pant","website":"http:\/\/ppant.wordpress.com","comment":"I m facing a issue with generated PDF size. There is a huge difference between size of the PDF generated in Windows and Linux platforms. \r\nI think this is because of embedding wrong fonts. \r\nThe detailed problem statement can be found in http:\/\/stackoverflow.com\/questions\/3193805\/wkhtmltopdf-generated-pdf-size-issues-in-cent-os-4-6\r\n\r\nWill appreciate if anybody can provide some help.\r\n\r\nThanks,\r\nPradeep\r\n","created":"2010-07-12 09:16:47"},{"name":"Anonymous","website":"","comment":"Last time I looked at xvfb-run it was a shell script that paused for 3 seconds waiting for the X server to start.  You might find that this three second pause is what takes the majority of the time you are seeing for the PDF to be generated.  I'd recommend not using the xvfb-run shell script and instead rapidly polling for the socket to be created in the \/tmp\/.X11 directory.  When this appears the X server is ready to accept client connections and you can invoke wkhtmltopdf.  \r\n\r\nActually, you have probably realized by now that the X server is not even required if you use the static binary (unless you are using web pages with certain plugins like flash).  Try skipping the xvfb-run wrapper entirely.\r\n\r\n","created":"2010-09-16 17:11:19"},{"name":"Eric","website":"","comment":"THANK YOU!!!!!\r\n\r\nYour install procedure was the ONLY one that worked for me for the Amazon Ubuntu AMIs for EC2 by Canonical (http:\/\/alestic.com\/2010\/08\/ec2-ami-canonical).\r\n\r\nYours worked perfectly out of the box. I was pulling my freakin hair out for 6 hrs pior!!","created":"2010-11-21 16:41:57"},{"name":"Brennan","website":"http:\/\/docraptor.com\/","comment":"Another tool for converting html to pdf (or html to excel) that's worth checking out is DocRaptor. http:\/\/docraptor.com\/","created":"2011-04-21 19:04:33"},{"name":"S.B","website":"","comment":"Did anyone get over the font-spacing issue when using QT rather than X?","created":"2011-07-12 11:55:52"},{"name":"Jeremy","website":"http:\/\/jscolton.com","comment":"Hi,\r\n\r\nI am using this tool to create a PDF.\r\n\r\nMy web page has dimensions of: 972px X 687px (29.7cm\/13.5\" at 72dpi, 21.0cm\/9.55\" at 72dpi).\r\n\r\nI put a border on my centralized div to check the edges.\r\n\r\nI used the following syntax to call the PDF tool:\r\n\r\nwkhtmltopdf runme.html runmeA4L.pdf --page-size A4 --orientation landscape --dpi 300\r\n\r\nThe resulting PDF says its properties are: 11.69\" x 8.26\" which is NOT A4!\r\n\r\nWhat is going on?\r\n\r\nI am viewing the PDF in Foxit Reader 3.3\r\n\r\nMany thanks for your help\r\nJeremy C.\r\n","created":"2011-09-20 14:34:52"},{"name":"Jeremy","website":"http:\/\/jscolton.com","comment":"...my mistake, is 2.5cm = 1\" :)\r\nDimensions are correct in the PDF to be 8.26\" x 11.69\" :)","created":"2011-09-20 14:44:20"},{"name":"Jeremy","website":"http:\/\/jscolton.com","comment":"...ok, having fixed my silly mistake I now have a web page size of 841px (11.69\"@72dpi) by 594px (8.26\"@72dpi).\r\n\r\nAnd still the resulting PDF has a border in it covering roughly half the page...It looks like the conversion has squashed the page...\r\n\r\nAny ideas?\r\n\r\nMany thanks again\r\nJeremy C.","created":"2011-09-20 14:51:55"}]},"rev-canonical-should-be-handled-with-care":{"title":"Rev-canonical should be handled with care","created":"2009-04-14 12:31:56","url":"rev-canonical-should-be-handled-with-care","tags":["web","microformats","html","seo"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"I have been loosely following the rev=\"canonical\" debate over the last few days. \r\nIt will be interesting to see if this idea matures into something truly usable but for now there are too many hurdles in the way.\r\nAlthough the whole thing is very interesting I can't help feeling that if some of the fundamental issues cannot be solved then this will all turn out to be a lot of hot air.\r\nThe most important of these, as you correctly point out is the semantics of rev=\"canonical\" and the depreciation of rev in HTML5. \r\n","created":"2009-04-14 15:40:58"},{"name":"Sam Johnston","website":"http:\/\/samj.net","comment":"I am more concerned about this even if only for the reason that getting it wrong (e.g. rel instead of rev) can destroy your site\/business... it's like having the ejector seat button next to the ignition. Save that it's like saying \"I am the canonical URL and that URL over there points at me\" so it must only ever be deployed on the canonical url itself.\r\n\r\nOf all the \/short[_- ]?ur[il]\/ permutations, rel=shortlink is the only one that is safe and unambiguous.\r\n\r\nSam\r\n ","created":"2009-04-21 09:38:37"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Sam, that's a very good point - a lot of @rev=\"canonical\" deployments do seem to be present on multiple URLs, which sort of defeats the point.\r\n\r\nIt's also massively open to cross-domain abuse, so I doubt any search engines will start paying attention to the @rev version.","created":"2009-04-21 10:33:09"}]},"changing-an-images-aspect-ratio-without-distortion-using-liquid-rescale":{"title":"Changing an image's aspect ratio without distortion, using Liquid Rescale","created":"2009-04-16 13:23:01","url":"changing-an-images-aspect-ratio-without-distortion-using-liquid-rescale","tags":["photography"]},"make-all-your-sites-work-in-ie8-with-one-fell-swoop":{"title":"Make all your sites work in IE8 with one fell swoop","created":"2009-04-17 11:22:27","url":"make-all-your-sites-work-in-ie8-with-one-fell-swoop","tags":["web","html","apache"]},"webmasters-opt-out-of-phorm-now":{"title":"Webmasters: opt out of Phorm now!","created":"2009-04-20 11:30:22","url":"webmasters-opt-out-of-phorm-now","tags":["web","privacy"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"I feel somewhat conflicted here. My daily income is 90% dependant on websites earning revenue based on a advertising supported business model. I also cannot stand advertising which is *not* targeted. \r\n\r\nHowever it is perfectly clear that the way that phorm have been going about implementing their technology is totally reprehensible. It should categorically be opt-in and not opt-out - both for users and content creators.\r\n\r\nThe fact that big player such as Wikipedia & Amazon have openly opted-out shows that there is significant resistance. Of course there is no way of telling which other sites have opted out without anyone knowing. \r\n\r\nAdditionally, news that European Commission will be starting legal action against the UK's data protection laws on this matter doesn't bode well for the future of the scheme.","created":"2009-04-20 12:17:51"}]},"working-out-the-speed-of-light-using-a-fish-pie":{"title":"Working out the speed of light using a fish pie","created":"2009-04-20 14:01:21","url":"working-out-the-speed-of-light-using-a-fish-pie","tags":["science"],"comments":[{"name":"Paul","website":"http:\/\/www.paulgoodwin.com","comment":"Interesting method, but I'd have probably used some kind of Cornish pasty rather than a fish pie on not making the office stink grounds.","created":"2009-04-20 14:10:44"},{"name":"RJ","website":"","comment":"How entertaining. Particularly since I ate my slice warm, while Sarah had hers cold with salad. Such options!","created":"2009-04-20 14:16:41"}]},"article-in-php-architect-maybe":{"title":"Article in php|architect (maybe)","created":"2009-05-26 10:37:03","url":"article-in-php-architect-maybe","tags":["php","writing"]},"Simplify-pagination-logic-using-a-custom-zend-paginator-adapter":{"title":"Simplify pagination logic using a custom Zend_Paginator_Adapter","created":"2009-06-13 18:18:16","url":"Simplify-pagination-logic-using-a-custom-zend-paginator-adapter","tags":["php","zend-framework","doctrine"],"comments":[{"name":"DavidZB","website":"","comment":"Awsome!. This may come very helpfull, now that Doctrine is a excelent tool to access database.","created":"2010-03-10 01:47:39"}]},"using-twitter-as-a-voting-platform":{"title":"Using Twitter as a voting platform","created":"2009-06-15 10:30:04","url":"using-twitter-as-a-voting-platform","tags":["php","web","zend-framework","startrekrank"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"10\/10 on the geek scale. ;)","created":"2009-06-15 11:09:36"}]},"xhtml-not-dead-despite-reports":{"title":"XHTML not dead, despite reports ","created":"2009-07-20 18:33:46","url":"xhtml-not-dead-despite-reports","tags":["web","html"]},"a-quick-update-on-my-life":{"title":"A quick update on my life","created":"2009-07-20 19:11:34","url":"a-quick-update-on-my-life"},"doctrine-article-in-php-architect":{"title":"Doctrine article in php|architect","created":"2009-08-27 07:56:25","url":"doctrine-article-in-php-architect","tags":["php","writing","doctrine"]},"fowa-2009-london-round-up":{"title":"FoWA London 2009 Round-up","created":"2009-10-06 16:41:35","url":"fowa-2009-london-round-up","tags":["web","fowa"],"comments":[{"name":"Paul","website":"","comment":"All I really took away is that the web app community has suddenly come to the conclusion that awkwardly shoehorning swear words into every sentence shows that you mean what you're saying.","created":"2009-10-06 17:25:04"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Paul, I know what you mean - there were quite a few potty mouths out there and generally they were the ones with the least to say!","created":"2009-10-06 17:27:10"},{"name":"Tomboa","website":"http:\/\/www.tomboa.net","comment":"Lots of interesting stuff!","created":"2009-10-06 18:01:48"},{"name":"bruce","website":"http:\/\/brucelawson.co.uk","comment":"Glad you liked the talk! ","created":"2009-10-06 20:02:36"},{"name":"DavidM","website":"http:\/\/www.openseo.co.uk","comment":"Thanks for the roundup, Ciaran. Very interesting. ","created":"2009-10-06 20:25:08"},{"name":"Carl","website":"http:\/\/sweetnr.com","comment":"@Paul I blame 37signals... http:\/\/37signals.com\/svn\/posts\/1214-profanity-works","created":"2009-10-07 10:45:00"}]},"why-you-should-close-php-sessions-as-soon-as-you-can":{"title":"Why you should close PHP sessions as soon as you can","created":"2009-12-23 10:54:49","url":"why-you-should-close-php-sessions-as-soon-as-you-can","tags":["php"]},"wag-gd-short-urls-with-a-point":{"title":"Wag.gd - short URLs with a point","created":"2009-12-29 10:21:32","url":"wag-gd-short-urls-with-a-point","tags":["mobile","web"],"comments":[{"name":"Simon Harris","website":"http:\/\/pointbeing.net\/","comment":"Cheers for the plug, old chap. Slightly chagrined that your blog post created more traffic than mine did, though!\r\n\r\nI'd argue that you've misquoted me somewhat on the subject of short URLs in general, but I can't really back that up. Regardless, I'll try to cobble together a post with my thoughts, now that I'm part of the URL shortening, uh, community.","created":"2009-12-29 22:45:43"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmnulty.com","comment":"Simon, it's because you refuse to use Twitter and I don't!\r\n\r\nI may have misrepresented you a little - IIRC you were getting quite annoyed at how much attention these services were getting a while back though. \r\n\r\nIt's good to see one with a point, rather than yet another clone of TinyURL!","created":"2009-12-30 08:03:10"}]},"clarifying-javascript-php-communication-using-json-rpc":{"title":"Clarifying Javascript-PHP communication using JSON-RPC","created":"2010-03-15 11:44:02","url":"clarifying-javascript-php-communication-using-json-rpc","tags":["php","web","javascript","zend-framework","jquery"],"comments":[{"name":"Nick","website":"http:\/\/dev.nuclearrooster.com","comment":"Hey, I'm looking at JSON RPC 2.0 instead of REST as well.  It seems like it is a little more defined (error handling, etc) than REST and faster to get up and running.  Any more thoughts after using it for a while?  Thanks","created":"2011-01-10 17:55:52"}]},"tether-to-iphone-with-ubuntu-9-10-karmic-koala":{"title":"Tether to iPhone with Ubuntu 9.10 Karmic Koala","created":"2010-03-24 20:40:23","url":"tether-to-iphone-with-ubuntu-9-10-karmic-koala","tags":["apple","linux","ubuntu"],"comments":[{"name":"Andre Lucas","website":"","comment":"FWIW the lucid beta2 version of Blueman worked just fine. Ta for your article. -A","created":"2010-04-20 13:27:28"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"Andre, That's interesting because I had a brief try on the Lucid alpha and it didn't work - I'll try and follow this up once Lucid gets a proper release.","created":"2010-04-21 15:51:53"},{"name":"Dave","website":"","comment":"Thanks for the tutorial. This worked fine with Lucid Linux release candidate","created":"2010-04-27 00:20:32"}]},"frontal-a-new-approach-to-triggering-javascript-behaviour":{"title":"Frontal - a new approach to triggering Javascript behaviour ","created":"2010-03-25 10:14:17","url":"frontal-a-new-approach-to-triggering-javascript-behaviour","tags":["javascript","frontal"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"In nearly all sites, except for the very biggest and the very smallest, I much prefer to have several seperate js files containing code for a specific part of the website or to perform a specific task. The same preference applies to css files too.\r\nFor cacheing and http requests this is not ideal but for simplicity, and ease of maintenance I much prefer it. \r\nIn situations where a single js file is prefered I could see the value in frontal. \r\n\r\nJquery plugin would be a massive win.","created":"2010-03-25 11:25:32"},{"name":"Jani Hartikainen","website":"http:\/\/codeutopia.net","comment":"This is an interesting approach indeed, but I can see some issues..\r\n\r\nFirstly, if you have a lot of page specific scripts, do you really want to load all of them on all pages? Not only will this increase the size of the script, it'll make parsing it slower due to size.\r\n\r\nSecondly, when developing JS code it's a good idea to separate it into multiple files - you don't put all of your PHP into one file either.\r\n\r\nPersonally I'm in favor of using a script to automatically concatenate and cache all scripts a specific page needs into a single file.","created":"2010-03-25 12:19:55"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"@Russell - is that for performance, or is it for ease of use at your end?\r\n\r\nWhat I've been thinking about this morning is that somehow you could specify the which JS applies to which page somewhere within your MVC app, and then the MVC framework could compile it into one big JS with Frontal rules giving the best of both worlds.","created":"2010-03-25 12:21:43"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"@Jani Organisationally in my codebase sure, the same applies to things like CSS, but if you're concatenating and caching before serving to the user, something like Frontal makes big sense.","created":"2010-03-25 12:23:30"},{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"Yeah, for ease of use rather than performance. Then combat any performance issues caused by multiple http requests with the concatenating and caching Jani recommends. ","created":"2010-03-25 14:00:18"},{"name":"Carl","website":"http:\/\/sweetnr.com","comment":"Glad to see i've inspired some debate.\r\n\r\nWhen i was first thrashing out this idea my first thought was to write a jQuery plugin. But wasn't convinced that my approach followed the jQuery paradigm of finding elements and then doing stuff to them.\r\n\r\nThat said it would only take a few lines to layer on the jQuery sugar.\r\n\r\nWe've just started a fresh ZF project at work and i plan to try writing our JavaScript on top of frontal; i'll be sure to write up my findings.","created":"2010-03-25 19:45:07"}]},"zend-framework-bindings-for-frontal":{"title":"Zend Framework bindings for Frontal","created":"2010-04-06 13:27:18","url":"zend-framework-bindings-for-frontal","tags":["php","javascript","zend-framework","frontal"]},"always-declare-a-media-type-in-your-css-links":{"title":"Always declare a media type in your CSS links","created":"2010-07-08 10:16:28","url":"always-declare-a-media-type-in-your-css-links","tags":["web","html","css"],"comments":[{"name":"ajbis","website":"http:\/\/www.ajbis.co.uk","comment":"funky","created":"2010-07-08 11:14:54"}]},"context-switching-in-the-18th-century":{"title":"Context switching in the 18th Century","created":"2010-07-09 10:20:39","url":"context-switching-in-the-18th-century","tags":["agile"],"comments":[{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"Imagine doing the washing up then half way through someone asks you to do the hoovering. \r\nYou dry your hands, get the hoover out, plug it it in. \r\nThen half way through hoovering someone asks you to do the ironing. \r\nYou unplug the hoover and put it away, get the iron out wait for it to heat up. \r\nBy this time the water in the washing up has gone cold and you need to run the water again.\r\n\r\nIn any other context people can understand the need for finishing a task and only doing the most urgent thing at any one time. \r\nPerhaps because non-technical people don't understand the amount of mental effort it takes to switch between projects they are unable to appreciate that the same applies to web development.\r\n\r\nA solid development process and a good project \/ product manager should shield the dev team from most of these interruptions.","created":"2010-07-09 13:11:05"}]},"top-5-barclays-cycle-hire-tips":{"title":"Top 5 Barclays Cycle Hire tips","created":"2010-10-19 20:02:22","url":"top-5-barclays-cycle-hire-tips"},"using-partial-mocks-in-phpunit-to-test-tricky-code ":{"title":"Using partial mocks in PHPUnit to test tricky code ","created":"2011-04-30 11:21:57","url":"using-partial-mocks-in-phpunit-to-test-tricky-code ","tags":["php","unit-testing"],"comments":[{"name":"stephan","website":"","comment":"how do i mock a class and still have access to its constants.\r\n\r\nclass MockMePlz {\r\n\r\n const DOG = 'dog';\r\n const CAT = 'cat';\r\n\r\n public function getSome( $str ) {\r\n   if( $str == self::DOG) return 'its a dog';\r\n   if( $str == self::CAT) return 'its a cat';\r\n   return false;\r\n }\r\n}\r\n\r\nclass myclass{\r\n\r\n public function getCat() {\r\n   $class = new MockMePlz();\r\n   return $class->getSome( MockMePlz::CAT );\r\n }\r\n}\r\n\r\nclass MyClassTest extends PHPUnit_Framework_Testcase\r\n{\r\n\r\n public function testGetCat() {\r\n   \r\n }\r\n}","created":"2011-06-14 12:50:27"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"@Stephan,\r\n\r\nBecause the mock extends MockMePlz you'd need to use static:: rather than self::","created":"2011-07-05 16:52:08"}]},"use-labelled-groups-in-regular-expressions-for-clearer-code":{"title":"Use labelled groups in Regular Expressions for clearer code","created":"2011-05-12 15:22:18","url":"use-labelled-groups-in-regular-expressions-for-clearer-code","tags":["php"],"comments":[{"name":"Simon Harris","website":"http:\/\/pointbeing.net\/","comment":"A useful tip indeed. It's worth noting that you still get the numerical as well as the labeled one - so one possible gotcha is that if you rely on count()ing $matches to see how many you got, you'll get misleading results.","created":"2011-06-15 16:21:16"}]},"a-great-customer-service-experience-from-amazon":{"title":"A great customer service experience from Amazon","created":"2011-07-05 13:04:37","url":"a-great-customer-service-experience-from-amazon","tags":["hardware","kindle"],"comments":[{"name":"Craig McGill","website":"http:\/\/www.contently-managed.com","comment":"I had a similar experience with them - case was cracked and I got in touch. While I thought the guy was just chatting for extra details he was actually organising a replacement Kindle for me. Top stuff (though reorganising all  my books was a nightmare).","created":"2011-07-05 13:15:13"},{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"Everyone I know who has a Kindle loves it but for some reason I have absolutely no desire to get one. Call me a Luddite but I just love proper books. They have an irreplaceable tactile quality. I have heard all the arguments as to why they are better but remain unconvinced. I will no doubt crumble one day and end up buying one but for now I am happy with my traditional books, with their indefinite battery life and their smash-proof front covers. ;)","created":"2011-07-05 13:17:20"},{"name":"Ciaran McNulty","website":"http:\/\/ciaranmcnulty.com","comment":"@Russell I still like paper books but having a 'mixed' approach with some stuff on Kindle is best for me at the moment.\r\n\r\nKindle offers cloudyness, portability, compactness (it's smaller\/thinner than a book) so is perfect for my commute.\r\n\r\nReal books offer a better tactile experience, and much better flicking-back-and-forth so are a lot better for reading in a leisurely reading context.\r\n\r\nBottom line for me is that the Kindle has got me reading more books, which I think has to be a good thing!","created":"2011-07-05 13:22:36"},{"name":"Russell","website":"http:\/\/rdjs.co.uk","comment":"If kindle is encouraging people to read more then I am all for it. ","created":"2011-07-05 13:45:07"},{"name":"James","website":"","comment":"@Russell I like proper CD's still - all music that I buy is still a CD - but can't remember the last time (other than to rip a copy) that I actually put one in a CD player to play. I'm sure I'll come around soon and just buy digital versions, but at the moment, I still get the thrill of opening a CD, looking at the sleeve and art work, then adding it into the dusty collection on the shelf.\r\n\r\nBut I think kindle is to books what mp3s are to music.","created":"2011-07-05 17:53:55"}]},"disabling-comments-on-this-blog":{"title":"Disabling comments on this blog","created":"2011-10-09 13:42:32","url":"disabling-comments-on-this-blog"},"unix-tips-handing-script-output":{"title":"Unix tips: handling script output","created":"2012-01-06 11:28:55","url":"unix-tips-handing-script-output"},"faster-failing-unit-tests":{"title":"Faster failing Unit Tests","created":"2012-02-08 09:16:36","url":"faster-failing-unit-tests","tags":["php","unit-testing"]}}